import 'package:flutter_application_2/EveningAzkar/EveningReapond.dart';
import 'package:flutter_application_2/Mosk/MoskReaponde.dart';

List<Map<String, dynamic>> data = [
  {
    "Azkir": {
      "Azkir":
          "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ \n اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا.",
      "Repetition": 1
    }
  },
  {
    "Azkir": {
      "Azkir":
          "دُعَاءُ دُخُولِ المَسْجِدِ\n يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:\n أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك",
      "Repetition": 3
    }
  },
  {
    "Azkir": {
      "Azkir":
          "دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ\nيَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:\nبِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم. ",
      "Repetition": 3
    }
  },

  //
];
List<MoskReapond> MoskList = data.map((e) => MoskReapond.fromjson(e)).toList();
